In [1]:
import pandas as pd

In [2]:
import os

In [9]:
basic_folder = 'new_data2'

file_list = os.listdir(f"./{basic_folder }")

In [10]:
file_list

['product_england_automobile.xlsx',
 'product_spain_semiconductor.xlsx',
 'product_france_automobile.xlsx',
 'product_england_battery.xlsx',
 'product_italy_metaverse.xlsx',
 'product_spain_automobile.xlsx',
 'product_canada_automobile.xlsx',
 'product_china_semiconductor.xlsx',
 'product_italy_automobile.xlsx',
 'product_italy_battery.xlsx',
 'product_south_africa_semiconductor.xlsx',
 'product_taiwan_battery.xlsx',
 'product_america_metaverse.xlsx',
 'product_america_battery.xlsx',
 'product_france_battery.xlsx',
 'product_spain_metaverse.xlsx',
 'product_china_metaverse.xlsx',
 'product_germany_metaverse.xlsx',
 'product_canada_battery.xlsx',
 'product_japan_automobile.xlsx',
 'product_south_africa_metaverse.xlsx',
 'product_japan_metaverse.xlsx',
 'product_america_automobile.xlsx',
 'product_germany_automobile.xlsx',
 'product_china_battery.xlsx',
 'product_canada_semiconductor.xlsx',
 'product_canada_metaverse.xlsx',
 'product_germany_battery.xlsx',
 'product_england_metaverse.xlsx',
 'product_america_semiconductor.xlsx',
 'product_taiwan_metaverse.xlsx',
 'product_japan_battery.xlsx',
 'product_germany_semiconductor.xlsx',
 'product_taiwan_semiconductor.xlsx',
 'product_spain_battery.xlsx',
 'product_japan_semiconductor.xlsx',
 'product_taiwan_automobile.xlsx',
 'product_south_africa_automobile.xlsx',
 'product_italy_semiconductor.xlsx',
 'product_france_metaverse.xlsx',
 'product_france_semiconductor.xlsx',
 'product_china_automobile.xlsx',
 'product_south_africa_battery.xlsx',
 'product_england_semiconductor.xlsx']

In [6]:
file_list_xls = []
for i in file_list:
    if ".xlsx" in i:
        file_list_xls.append(i)

file_list_xls

['product_england_automobile.xlsx',
 'product_spain_semiconductor.xlsx',
 'product_france_automobile.xlsx',
 'product_england_battery.xlsx',
 'product_italy_metaverse.xlsx',
 'product_spain_automobile.xlsx',
 'product_canada_automobile.xlsx',
 'product_china_semiconductor.xlsx',
 'product_italy_automobile.xlsx',
 'product_italy_battery.xlsx',
 'product_south_africa_semiconductor.xlsx',
 'product_taiwan_battery.xlsx',
 'product_america_metaverse.xlsx',
 'product_america_battery.xlsx',
 'product_france_battery.xlsx',
 'product_spain_metaverse.xlsx',
 'product_china_metaverse.xlsx',
 'product_germany_metaverse.xlsx',
 'product_canada_battery.xlsx',
 'product_japan_automobile.xlsx',
 'product_south_africa_metaverse.xlsx',
 'product_japan_metaverse.xlsx',
 'product_america_automobile.xlsx',
 'product_germany_automobile.xlsx',
 'product_china_battery.xlsx',
 'product_canada_semiconductor.xlsx',
 'product_canada_metaverse.xlsx',
 'product_germany_battery.xlsx',
 'product_england_metaverse.xlsx',
 'product_america_semiconductor.xlsx',
 'product_taiwan_metaverse.xlsx',
 'product_japan_battery.xlsx',
 'product_germany_semiconductor.xlsx',
 'product_taiwan_semiconductor.xlsx',
 'product_spain_battery.xlsx',
 'product_japan_semiconductor.xlsx',
 'product_taiwan_automobile.xlsx',
 'product_south_africa_automobile.xlsx',
 'product_italy_semiconductor.xlsx',
 'product_france_metaverse.xlsx',
 'product_france_semiconductor.xlsx',
 'product_china_automobile.xlsx',
 'product_south_africa_battery.xlsx',
 'product_england_semiconductor.xlsx']

In [14]:
data_unit_sum = pd.DataFrame()
for i in file_list_xls:
    df = pd.read_excel(f"./{basic_folder }/" + i)
    df['나라'] = i.split("_")[1]
    data_unit = df[['나라', '조사제품', '제목', '내용']]
    data_unit_sum = pd.concat([data_unit_sum, data_unit], axis = 0)

data_unit_sum.to_excel('combiend_excel.xlsx')

In [15]:
product_list = data_unit_sum['조사제품'].value_counts()
for i in dict(product_list):
    xls_name = data_unit_sum[data_unit_sum['조사제품'] == i]
    xls_name.to_excel(f"{i}.xlsx")

In [16]:
product_list

metaverse        89
battery          86
automobile       81
semiconductor    80
Name: 조사제품, dtype: int64

In [17]:
dict(product_list)

{'metaverse': 89, 'battery': 86, 'automobile': 81, 'semiconductor': 80}

In [18]:
xls_name

,나라,조사제품,제목,내용
0,spain,semiconductor,"Yoon Suk-yeol, first lady, have an eventful fl...","in Spain. Ahead of the summit, a presidential ..."
1,spain,semiconductor,"Yoon touts nuclear energy, green tech, chips a...",Yoon returned home on Friday after attending t...
2,spain,semiconductor,"S. Korea, US, Japan agree to step up pressure ...","Madrid, Spain, Wednesday (local time). The las..."
3,spain,semiconductor,"Yoon, Kishida exchange political pleasantries ...","MADRID, Spain — President Yoon Suk-yeol and Ja..."
4,spain,semiconductor,(News Focus) Yoon-NATO summit,to Spain put his administration's priorities o...
...,...,...,...,...
1,england,semiconductor,Competition in Semiconductor Market Now Intern...,"""The late founder remarked that England invent..."
2,england,semiconductor,Biden’s TikTok Problem,(WSJ) Semiconductor companies told Congress th...
3,england,semiconductor,[ANALYSIS] Korea aspiring to become battery bu...,"to England in June. Also, it was reported that..."
4,england,semiconductor,China Escalates Its Fight Against Big Tech,Further reading: A look at the $150 million se...
5,england,semiconductor,Lack of Tiny Parts Disrupts Auto Factories Wor...,"At the same time, semiconductor makers shifted..."

# pandas 기본 문법

In [37]:
df = pd.read_excel("excel_sample.xlsx")

In [38]:
df

  Unnamed: 0        a         b          c
0          가        1        10        100
1          나     1000     10000     100000
2          다  1000000  10000000  100000000

In [39]:
df1 = df.transpose()

In [40]:
df1

              0       1          2
Unnamed: 0    가       나          다
a             1    1000    1000000
b            10   10000   10000000
c           100  100000  100000000

In [41]:
df1 = df1.rename(columns = df1.iloc[0])

In [42]:
df1

              가       나          다
Unnamed: 0    가       나          다
a             1    1000    1000000
b            10   10000   10000000
c           100  100000  100000000

In [43]:
df1 = df1.drop(df1.index[0])

In [44]:
df1

     가       나          다
a    1    1000    1000000
b   10   10000   10000000
c  100  100000  100000000

In [45]:
df2 = df
df2.index = df2['Unnamed: 0'].values

In [46]:
df2

  Unnamed: 0        a         b          c
가          가        1        10        100
나          나     1000     10000     100000
다          다  1000000  10000000  100000000

In [47]:
df2.index

Index(['가', '나', '다'], dtype='object')

In [48]:
df.index

Index(['가', '나', '다'], dtype='object')

In [49]:
df2.drop(['Unnamed: 0'], axis = 1, inplace = True)

In [50]:
df2

         a         b          c
가        1        10        100
나     1000     10000     100000
다  1000000  10000000  100000000